armfly/H7-TOOL_STM32H7_App/User/lua/if/lua_if_swd.c
#include "lauxlib.h"
#include "lualib.h"
#include "time.h"
#include "lua_if.h"
#include "bsp.h"
#include "elf_file.h"
#include "file_lib.h"
#include "prog_if.h"
#include "target_reset.h"
#include "target_config.h"
#include "swd_host.h"
#include "swd_host_multi.h"
#include "Systick_Handler.h"
#include "main.h"
#include "target_family.h"
#include "stm8_flash.h"
#include "stm8_swim.h"
#include "swd_flash.h"
#include "SW_DP_Multi.h"

/* 为了避免和DAP驱动中的函数混淆，本模块函数名前缀用 h7swd */

static int h7swd_Init(lua_State* L);
static int h7swd_ReadID(lua_State* L);
static int h7swd_WriteMemory(lua_State* L);
static int h7swd_ReadMemory(lua_State* L);

static int h7swd_Write32(lua_State* L);
static int h7swd_Read32(lua_State* L);
static int h7swd_Write16(lua_State* L);
static int h7swd_Read16(lua_State* L);
static int h7swd_Write8(lua_State* L);
static int h7swd_Read8(lua_State* L);

static int h7_LoadAlgoFile(lua_State* L);
static int h7_ProgFile(lua_State* L);
static int h7_ProgBuf(lua_State* L);
static int h7_ProgBuf_OB(lua_State* L);
static int h7_Read_OptionBytes(lua_State* L);
static int h7_reset(lua_State* L);
static int h7_DetectIC(lua_State* L);
static int h7_PrintText(lua_State* L);
static int h7_EraseChip(lua_State* L);
static int h7_EraseSector(lua_State* L);

static int h7_Read_ProductSN(lua_State* L);
static int h7_Write_ProductSN(lua_State* L);
static int h7_ReloadLuaVar(lua_State* L);
static int h7_ReadCVar(lua_State* L);

static int h7swd_ReadExtID(lua_State* L);


/*
*********************************************************************************************************
*    函 数 名: lua_swd_RegisterFun
*    功能说明: 注册lua C语言接口函数
*    形    参: 无
*    返 回 值: 无
*********************************************************************************************************
*/
extern void PG_PrintText(char *_str);
void lua_swd_RegisterFun(void)
{
    //将指定的函数注册为Lua的全局函数变量，其中第一个字符串参数为Lua代码
    //在调用C函数时使用的全局函数名，第二个参数为实际C函数的指针。
//    lua_register(g_Lua, "swd_init", h7swd_Init);    
//    lua_register(g_Lua, "swd_getid", h7swd_ReadID);
//    
//    lua_register(g_Lua, "swd_write", h7swd_WriteMemory);    
//    lua_register(g_Lua, "swd_read", h7swd_ReadMemory);

    lua_register(g_Lua, "pg_init", h7swd_Init);    
    lua_register(g_Lua, "pg_get_chip_id", h7swd_ReadID);    
    lua_register(g_Lua, "pg_write_mem", h7swd_WriteMemory); 	
    lua_register(g_Lua, "pg_read_mem", h7swd_ReadMemory);  

    lua_register(g_Lua, "pg_write32", h7swd_Write32);    
    lua_register(g_Lua, "pg_read32", h7swd_Read32);  
    lua_register(g_Lua, "pg_write16", h7swd_Write16);    
    lua_register(g_Lua, "pg_read16", h7swd_Read16);  
    lua_register(g_Lua, "pg_write8", h7swd_Write8);    
    lua_register(g_Lua, "pg_read8", h7swd_Read8);
    
    lua_register(g_Lua, "pg_get_ext_id", h7swd_ReadExtID);     
        
    lua_register(g_Lua, "pg_load_algo_file", h7_LoadAlgoFile);
    lua_register(g_Lua, "pg_prog_file", h7_ProgFile);
    lua_register(g_Lua, "pg_prog_buf", h7_ProgBuf);
    lua_register(g_Lua, "pg_prog_buf_ob", h7_ProgBuf_OB);
    lua_register(g_Lua, "pg_read_ob", h7_Read_OptionBytes);    
    lua_register(g_Lua, "pg_reset", h7_reset);
    lua_register(g_Lua, "pg_detect_ic", h7_DetectIC);
    lua_register(g_Lua, "pg_erase_chip", h7_EraseChip);   
    lua_register(g_Lua, "pg_erase_sector", h7_EraseSector);       
    
    lua_register(g_Lua, "pg_print_text", h7_PrintText);
    lua_register(g_Lua, "pg_read_sn", h7_Read_ProductSN);
    lua_register(g_Lua, "pg_write_sn", h7_Write_ProductSN);
    
    lua_register(g_Lua, "pg_reload_var", h7_ReloadLuaVar);
    
    lua_register(g_Lua, "pg_read_c_var", h7_ReadCVar);
}

/*
*********************************************************************************************************
*    函 数 名: h7_ReloadLuaVar
*    功能说明: lua通知程序更新变量
*    形    参: 无
*    返 回 值: 无
*********************************************************************************************************
*/
extern uint8_t PG_LuaUidSnUsr(void);
static int h7_ReloadLuaVar(lua_State* L)
{
    const char *pVarName;
    size_t len;
    
    if (lua_type(L, 1) == LUA_TSTRING)              /* 判断第1个参数 */
    {
        pVarName = luaL_checklstring(L, 1, &len);   /* 1是参数的位置， len是string的长度 */   
            
        if (strcmp(pVarName, "UidSnUsr") == 0)
        {
            PG_LuaUidSnUsr(); 
        }
        else if (strcmp(pVarName, "ChipInfo") == 0)
        {
            PG_ReloadLuaVar();
        }    
    }
    else
    {
        PG_ReloadLuaVar();
    }
    return 0;
}

/*
*********************************************************************************************************
*    函 数 名: h7_ReadCVar
*    功能说明: lua读取c全局变量
*    形    参: 无
*    返 回 值: 无
*********************************************************************************************************
*/
static int h7_ReadCVar(lua_State* L)
{
    const char *pVarName;
    size_t len;
        
    if (lua_type(L, 1) == LUA_TSTRING)              /* 判断第1个参数 */
    {        
        pVarName = luaL_checklstring(L, 1, &len);   /* 1是参数的位置， len是string的长度 */   
        
        if (strcmp(pVarName, "MultiProgMode") == 0)
        {
            lua_pushnumber(L, g_gMulSwd.MultiMode);   
        }
        else
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }        
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
    }  
    
    return 1;
}
/*
*********************************************************************************************************
*    函 数 名: h7swd_Init
*    功能说明: 初始化swd
*    形    参: 无
*    返 回 值: 无
*********************************************************************************************************
*/
static int h7swd_Init(lua_State* L)
{
    if (g_tProg.ChipType == CHIP_SWD_ARM)
    {   
        sysTickInit();          /* 这是DAP驱动中的初始化函数,全局变量初始化 */

        if (g_gMulSwd.MultiMode > 0)   /* 多路模式 */
        {
            MUL_swd_init_debug();   /* 进入swd debug状态 */    
        }
        else
        {
            swd_init_debug();       /* 进入swd debug状态 */
        }
    }
    else if (g_tProg.ChipType == CHIP_SWIM_STM8)
    {        
        SWIM_InitHard();           /* 进入swd debug状态 */
        
        SWIM_EntrySequence();            
    }
    else
    {
        ;
    }
            
    return 1;
}

