armfly/H7-TOOL_STM32H7_App/User/lua/if/lua_if_swd.c
/*
*********************************************************************************************************
*    函 数 名: h7swd_ReadID
*    功能说明: 读芯片ID
*    形    参: 无
*    返 回 值: 无
*********************************************************************************************************
*/
static int h7swd_ReadID(lua_State* L)
{
    uint32_t id;
    uint32_t id_buf[4];

    if (g_tProg.ChipType == CHIP_SWD_ARM)
    {
		if (g_gMulSwd.MultiMode > 0)   /* 多路模式 */
        {
	        if (MUL_swd_read_idcode(id_buf) == 0)        
	        {
	            lua_pushnumber(L, 0);    /* 出错 */
	        }
	        else
	        {
	            lua_pushnumber(L, id);    /* 成功,返回ID */
	        }             
		}
		else
		{
	        if (swd_read_idcode(&id) == 0)   
	        {
	            lua_pushnumber(L, 0);    /* 出错 */
	        }
	        else
	        {
	            lua_pushnumber(L, id);    /* 成功,返回ID */
	        }			
		}
    }
    else if (g_tProg.ChipType == CHIP_SWIM_STM8)
    {
        id = 0x00000800;            /* STM8没有ID, 填一个固定值 */
        lua_pushnumber(L, id);      /* 成功,返回ID */        
    }
    else
    {
        id = 0;
        lua_pushnumber(L, 0);    /* 出错 */
    }
    return 1;
}

/*
*********************************************************************************************************
*    函 数 名: h7swd_WriteMemory
*    功能说明: 写CPU内存（或寄存器）
*    形    参: addr : 目标地址
*                data : 数据缓冲区，含长度
*    返 回 值: 0 失败   1 成功
*********************************************************************************************************
*/
static int h7swd_WriteMemory(lua_State* L)
{
    uint32_t addr = 0;
    const char *data;
    size_t len = 0;
    
//    sysTickInit();    /* 这是DAP驱动中的初始化函数,全局变量初始化 */

    if (lua_type(L, 1) == LUA_TNUMBER) /* 判断第1个参数 */
    {
        addr = luaL_checknumber(L, 1);    /* 目标内存地址 */
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;        
    }

    if (lua_type(L, 2) == LUA_TSTRING)     /* 判断第2个参数 */
    {        
        data = luaL_checklstring(L, 2, &len); /* 1是参数的位置， len是string的长度 */        
    }
    
    if (len > 128 * 1024)
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    }
    
    if (g_tProg.ChipType == CHIP_SWD_ARM) 
    {
        if (g_gMulSwd.MultiMode > 0)   /* 多路模式 */
        {
            if (MUL_swd_write_memory(addr, (uint8_t *)data, len) == 0)
            {
                lua_pushnumber(L, 0);    /* 出错 */
            }
            else
            {
                lua_pushnumber(L, 1);    /* 成功 */
            }
        }
        else
        {
            if (swd_write_memory(addr, (uint8_t *)data, len) == 0)
            {
                lua_pushnumber(L, 0);    /* 出错 */
            }
            else
            {
                lua_pushnumber(L, 1);    /* 成功 */
            }                       
        }            
    }
    else if (g_tProg.ChipType == CHIP_SWIM_STM8)
    {
        if (SWIM_WriteBuf(addr, (uint8_t *)data, len) == 0)
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }
        else
        {
            lua_pushnumber(L, 1);    /* 成功 */
        }
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */       
    }    
    return 1;
}

/*
*********************************************************************************************************
*    函 数 名: h7swd_ReadMemory
*    功能说明: 读CPU内存（或寄存器）
*    形    参: addr : 目标地址
*                data : 数据缓冲区，含长度
*    返 回 值: 0 失败   1 成功
*********************************************************************************************************
*/
static int h7swd_ReadMemory(lua_State* L)
{
    uint32_t addr;
    uint32_t num;

    if (lua_type(L, 1) == LUA_TNUMBER)     /* 判断第1个参数 */
    {        
        addr = luaL_checknumber(L, 1); /* 1是参数的位置， len是string的长度 */        
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    }
    
    if (lua_type(L, 2) == LUA_TNUMBER) /* 判断第2个参数 */
    {
        num = luaL_checknumber(L, 2);
        
        memset(s_lua_read_buf, 0, num);        
    }
    
    if (num > LUA_READ_LEN_MAX)
    {
        lua_pushnumber(L, 0);    /* 长度溢出，出错 */
        return 1;
    }
    
    if (g_tProg.ChipType == CHIP_SWD_ARM)
    {
        if (g_gMulSwd.MultiMode > 0)   /* 多路模式 */
        {    
            if (MUL_swd_read_memory(addr, s_lua_read_buf, num) == 0)
            {
                lua_pushnumber(L, 0);    /* 出错 */
            }
            else
            {
                lua_pushnumber(L, 1);    /* 成功 */
            }
            
            lua_pushlstring(L, (char *)s_lua_read_buf, num); 
            lua_pushlstring(L, (char *)(s_lua_read_buf + num), num); 
            lua_pushlstring(L, (char *)(s_lua_read_buf + 2 * num), num); 
            lua_pushlstring(L, (char *)(s_lua_read_buf + 3 * num), num); 
            return 5;
        }
        else
        {            
            if (swd_read_memory(addr, s_lua_read_buf, num) == 0)
            {
                lua_pushnumber(L, 0);    /* 出错 */
            }
            else
            {
                lua_pushnumber(L, 1);    /* 成功 */
            }

            lua_pushlstring(L, (char *)s_lua_read_buf, num); 
            
            return 2;
        }
    }
    else if (g_tProg.ChipType == CHIP_SWIM_STM8)
    {
        if (SWIM_ReadBuf(addr, s_lua_read_buf, num) == 0)
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }
        else
        {
            lua_pushnumber(L, 1);    /* 成功 */
        }
        
        lua_pushlstring(L, (char *)s_lua_read_buf, num); 
        return 2;        
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */   
        return 1;
    }   
}

/*
*********************************************************************************************************
*    函 数 名: h7swd_Write32
*    功能说明: 写CPU内存（或寄存器）
*    形    参: addr : 目标地址
*              data : 数据
*    返 回 值: 0 失败   1 成功
*********************************************************************************************************
*/
static int h7swd_Write32(lua_State* L)
{
    uint32_t addr = 0;
    uint32_t data;

