armfly/H7-TOOL_STM32H7_App/User/lua/if/lua_if_swd.c
    if (lua_type(L, 1) == LUA_TNUMBER) 		/* 判断第1个参数 */
    {
        addr = luaL_checknumber(L, 1);      /* 目标内存地址 */
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;        
    }

    if (lua_type(L, 2) == LUA_TNUMBER)      /* 判断第2个参数 */
    {        
        data = luaL_checknumber(L, 2);      /* 目标内存地址 */
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;        
    }    
    
    if (g_tProg.ChipType == CHIP_SWD_ARM) 
    {
        if (g_gMulSwd.MultiMode > 0)   /* 多路模式 */
        {
            if (MUL_swd_write_memory(addr, (uint8_t *)&data, 4) == 0)
            {
                lua_pushnumber(L, 0);    /* 出错 */
            }
            else
            {
                lua_pushnumber(L, 1);    /* 成功 */
            }
        }
        else
        {
            if (swd_write_memory(addr, (uint8_t *)&data, 4) == 0)
            {
                lua_pushnumber(L, 0);    /* 出错 */
            }
            else
            {
                lua_pushnumber(L, 1);    /* 成功 */
            }                       
        }            
    }
    else if (g_tProg.ChipType == CHIP_SWIM_STM8)
    {
        if (SWIM_WriteBuf(addr, (uint8_t *)&data, 4) == 0)
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }
        else
        {
            lua_pushnumber(L, 1);    /* 成功 */
        }
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */       
    }    
    return 1;
}

/*
*********************************************************************************************************
*    函 数 名: h7swd_Write16
*    功能说明: 写CPU内存（或寄存器）
*    形    参: addr : 目标地址
*              data : 数据
*    返 回 值: 0 失败   1 成功
*********************************************************************************************************
*/
static int h7swd_Write16(lua_State* L)
{
    uint32_t addr = 0;
    uint16_t data;

    if (lua_type(L, 1) == LUA_TNUMBER) 		/* 判断第1个参数 */
    {
        addr = luaL_checknumber(L, 1);      /* 目标内存地址 */
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;        
    }

    if (lua_type(L, 2) == LUA_TNUMBER)      /* 判断第2个参数 */
    {        
        data = luaL_checknumber(L, 2);      /* 目标内存地址 */
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;        
    }    
    
    if (g_tProg.ChipType == CHIP_SWD_ARM) 
    {
        if (g_gMulSwd.MultiMode > 0)   /* 多路模式 */
        {
            if (MUL_swd_write_memory(addr, (uint8_t *)&data, 2) == 0)
            {
                lua_pushnumber(L, 0);    /* 出错 */
            }
            else
            {
                lua_pushnumber(L, 1);    /* 成功 */
            }
        }
        else
        {
            if (swd_write_memory(addr, (uint8_t *)&data, 2) == 0)
            {
                lua_pushnumber(L, 0);    /* 出错 */
            }
            else
            {
                lua_pushnumber(L, 1);    /* 成功 */
            }                       
        }            
    }
    else if (g_tProg.ChipType == CHIP_SWIM_STM8)
    {
        if (SWIM_WriteBuf(addr, (uint8_t *)&data, 2) == 2)
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }
        else
        {
            lua_pushnumber(L, 1);    /* 成功 */
        }
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */       
    }    
    return 1;
}

/*
*********************************************************************************************************
*    函 数 名: h7swd_Write8
*    功能说明: 写CPU内存（或寄存器）
*    形    参: addr : 目标地址
*              data : 数据
*    返 回 值: 0 失败   1 成功
*********************************************************************************************************
*/
static int h7swd_Write8(lua_State* L)
{
    uint32_t addr = 0;
    uint8_t data;

    if (lua_type(L, 1) == LUA_TNUMBER) 		/* 判断第1个参数 */
    {
        addr = luaL_checknumber(L, 1);      /* 目标内存地址 */
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;        
    }

    if (lua_type(L, 2) == LUA_TNUMBER)      /* 判断第2个参数 */
    {        
        data = luaL_checknumber(L, 2);      /* 目标内存地址 */
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;        
    }    
    
    if (g_tProg.ChipType == CHIP_SWD_ARM) 
    {
        if (g_gMulSwd.MultiMode > 0)   /* 多路模式 */
        {
            if (MUL_swd_write_memory(addr, (uint8_t *)&data, 1) == 0)
            {
                lua_pushnumber(L, 0);    /* 出错 */
            }
            else
            {
                lua_pushnumber(L, 1);    /* 成功 */
            }
        }
        else
        {
            if (swd_write_memory(addr, (uint8_t *)&data, 1) == 0)
            {
                lua_pushnumber(L, 0);    /* 出错 */
            }
            else
            {
                lua_pushnumber(L, 1);    /* 成功 */
            }                       
        }            
    }
    else if (g_tProg.ChipType == CHIP_SWIM_STM8)
    {
        if (SWIM_WriteBuf(addr, (uint8_t *)&data, 1) == 0)
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }
        else
        {
            lua_pushnumber(L, 1);    /* 成功 */
        }
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */       
    }    
    return 1;
}

/*
*********************************************************************************************************
*    函 数 名: h7swd_Read32
*    功能说明: 读CPU内存（或寄存器）
*    形    参: addr : 目标地址
*              data : 数据缓冲区，含长度
*    返 回 值: 0 失败   1 成功
*********************************************************************************************************
*/
static int h7swd_Read32(lua_State* L)
{
    uint32_t addr;
    uint32_t num = 4;
    uint8_t err = 0;

    if (lua_type(L, 1) == LUA_TNUMBER)      /* 判断第1个参数 */
    {        
        addr = luaL_checknumber(L, 1);      /* 1是参数的位置， len是string的长度 */        
    }
    else
    {
        return 0;   /* 返回 nil */
    }
    
    if (g_tProg.ChipType == CHIP_SWD_ARM)
    {
        if (g_gMulSwd.MultiMode > 0)   /* 多路模式 */
        {    
            memset(s_lua_read_buf, 0, 4 * num);
            if (MUL_swd_read_memory(addr, s_lua_read_buf, num) == 0)
            {
                err = 1;
            }

            lua_pushnumber(L, *(uint32_t *)s_lua_read_buf);
            lua_pushnumber(L, *(uint32_t *)(s_lua_read_buf + num));
            lua_pushnumber(L, *(uint32_t *)(s_lua_read_buf + 2 * num));
            lua_pushnumber(L, *(uint32_t *)(s_lua_read_buf + 3 * num));
            
