armfly/H7-TOOL_STM32H7_App/User/lua/if/lua_if_swd.c
        if (err == 1)        
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }
        else
        {
            lua_pushnumber(L, 1);    /* 成功 */
        }
        return 2;        
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        lua_pushnumber(L, 0);    /* 出错 */ 
        return 2;
    } 
}

/*
*********************************************************************************************************
*    函 数 名: h7_LoadAlgoFile
*    功能说明: 装载算法文件
*    形    参: file_path 算法文件路径，是相对路径
*    返 回 值: 0 失败   1 成功
*********************************************************************************************************
*/
static int h7_LoadAlgoFile(lua_State* L)
{
    // pg_load_algo_file(AlgoFile, AlgoRamAddr, AlgoRamSize)
    const char *data;
    size_t len = 0;

    g_AlgoRam.Valid = 0;
    
    if (lua_type(L, 1) == LUA_TSTRING)     /* 判断第1个参数 */
    {        
        data = luaL_checklstring(L, 1, &len); /* 1是参数的位置， len是string的长度 */   
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    }
    
    if (lua_type(L, 2) == LUA_TNUMBER) /* 判断第2个参数 */
    {
        g_AlgoRam.Addr = luaL_checknumber(L, 2);       
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    }    
    
    if (lua_type(L, 3) == LUA_TNUMBER) /* 判断第3个参数 */
    {
        g_AlgoRam.Size = luaL_checknumber(L, 3);       
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    }
    
    if (lua_type(L, 4) == LUA_TNUMBER) /* 判断第4个参数 (一般不用）*/
    {
        g_tVar.SaveAlgoToCFile = luaL_checknumber(L, 4);
    }
    else
    {
        g_tVar.SaveAlgoToCFile = 0;
    }
    
    g_AlgoRam.Valid = 1;
    
    /* lua程序提供的路径是相对路径 */
    {
        if (data[0] == '0' && data[1] == ':')     /* 是绝对路径 */
        {
            if (ELF_ParseFile((char *)data) != 0)
            {
                lua_pushnumber(L, 0);    /* 出错 */
                return 1;
            }
        }
        else    /* 是相对路径 */ 
        {    
            char path[256];
            
            GetDirOfFileName(g_tProg.FilePath, path);   /* 从lua文件名、中获取目录 */
            
            if (strlen(path) + strlen(data) + 1 > sizeof(path))
            {
                printf("FLM file name is too long\r\n");
                lua_pushnumber(L, 0);    /* 路径过长出错 */
                return 1;                
            }
            
            strcat(path, "/");
            strcat(path, data);

            FixFileName(path);  /* 去掉路径中的..上级目录 */ 
            
            if (ELF_ParseFile((char *)path) != 0)
            {
                lua_pushnumber(L, 0);    /* 出错 */
                return 1;
            }            
        }    
    }
    
    lua_pushnumber(L, 1);    /*OK */
    return 1;    
}

/*
*********************************************************************************************************
*    函 数 名: h7_ProgFile
*    功能说明: 开始编程，从文件读取数据
*    形    参: file_path 数据文件名称, 目标flash地址
*    返 回 值: 0 失败   1 成功
*********************************************************************************************************
*/
static int h7_ProgFile(lua_State* L)
{
    const char *file_name;
    size_t len = 0;
    uint32_t FlashAddr;
    
    if (lua_type(L, 1) == LUA_TSTRING)     /* 判断第1个参数 */
    {        
        file_name = luaL_checklstring(L, 1, &len); /* 1是参数的位置， len是string的长度 */   
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    }
    
    if (lua_type(L, 2) == LUA_TNUMBER) /* 判断第2个参数 */
    {
        FlashAddr = luaL_checknumber(L, 2);       
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    } 
       
    if (g_tProg.ChipType == CHIP_SWD_ARM)
    {    
        if (PG_SWD_ProgFile((char *)file_name, FlashAddr) == 0)
        {
            lua_pushnumber(L, 1);    /*OK */
        }
        else
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }
    }
    else if (g_tProg.ChipType == CHIP_SWIM_STM8)
    {
        if (PG_SWIM_ProgFile((char *)file_name, FlashAddr) == 0)
        {
            lua_pushnumber(L, 1);    /*OK */
        }
        else
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }        
    }  
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
    }    
    return 1;    
}

/*
*********************************************************************************************************
*    函 数 名: h7_reset
*    功能说明: 执行硬件复位
*    形    参: 无
*    返 回 值: 无
*********************************************************************************************************
*/
extern void MUL_swd_set_target_reset(uint8_t asserted);
static int h7_reset(lua_State* L)
{   
    uint32_t delay;
    
    
    if (lua_type(L, 1) == LUA_TNUMBER) /* 判断第1个参数 */
    {
        delay = luaL_checknumber(L, 1);       
    }
    else
    {
        delay = 20;     /* 没有形参，则用20ms */
    } 
    
    /* 硬件复位 */
    if (g_gMulSwd.MultiMode > 0)   /* 多路模式 */
    {
        MUL_swd_set_target_reset(1);
        osDelay(delay);
        MUL_swd_set_target_reset(0);
        osDelay(delay); 
    }
    else        
    {
        swd_set_target_reset(1);
        osDelay(delay);
        swd_set_target_reset(0);
        osDelay(delay); 
    }
    
    return 0;
}

/*
*********************************************************************************************************
*    函 数 名: h7_DetectIC
*    功能说明: 检测CPU ID
*    形    参: 无
*    返 回 值: 0 失败   > 0 成功
*********************************************************************************************************
*/
static int h7_DetectIC(lua_State* L)
{
    if (g_tProg.ChipType == CHIP_SWD_ARM)
    {            
        if (g_gMulSwd.MultiMode > 0)   /* 多路模式 */
        {
            uint8_t i;
            uint32_t id[4] = {0};
            
            sysTickInit();    /* 这是DAP驱动中的初始化函数,全局变量初始化 */            
            for (i = 0; i < 3; i++)
            {
                bsp_DelayUS(5 * 1000);     /* 延迟5ms */
                
                MUL_swd_init_debug();           /* 进入swd debug状态 */
                
                if (MUL_swd_read_idcode(id) == 0)
                {
                    //id = 0;     /* 出错继续检测 */
                }
                else
                {
                    break;            
                }   
            }
        
