armfly/H7-TOOL_STM32H7_App/User/lua/if/lua_if_swd.c
            lua_pushnumber(L, id[0]);    /* 成功,返回ID */
            lua_pushnumber(L, id[1]);    /* 成功,返回ID */
            lua_pushnumber(L, id[2]);    /* 成功,返回ID */
            lua_pushnumber(L, id[3]);    /* 成功,返回ID */            
            return 4;  
        }
        else
        {            
            uint8_t i;
            uint32_t id = 0;
            
            for (i = 0; i < 3; i++)
            {
                sysTickInit();    /* 这是DAP驱动中的初始化函数,全局变量初始化 */
            
                bsp_DelayUS(5 * 1000);     /* 延迟10ms */
                
                swd_init_debug();           /* 进入swd debug状态 */
                
                if (swd_read_idcode(&id) == 0)
                {
                    id = 0;     /* 出错继续检测 */
                }
                else
                {
                    break;            
                }   
            }
        
            lua_pushnumber(L, id);    /* 成功,返回ID */
            return 1;          
        }
    }
    else if (g_tProg.ChipType == CHIP_SWIM_STM8) 
    {
        uint32_t id;
        
        if (SWIM_DetectIC(&id) == 0)
        {
            id = 0;     /* 失败 */
        }        
        lua_pushnumber(L, id);      /* 成功,返回ID */
        return 1;
    }
    lua_pushnumber(L, -1);          /* 失败 */
    return 1;
}

/*
*********************************************************************************************************
*    函 数 名: h7_PrintText
*    功能说明: 在LCD显示一串文本
*    形    参: 无
*    返 回 值: 0 失败   1 成功
*********************************************************************************************************
*/
static int h7_PrintText(lua_State* L)
{
    const char *str;
     size_t len = 0;
    
    if (lua_type(L, 1) == LUA_TSTRING)     /* 判断第1个参数 */
    {        
        str = luaL_checklstring(L, 1, &len); /* 1是参数的位置， len是string的长度 */   
        
        if (g_MainStatus == MS_PROG_WORK)
        {
            printf(str);
            printf("\r\n");
                    
            if (g_MainStatus == MS_PROG_WORK)
            {
                DispProgProgress((char *)str, -1, 0xFFFFFFFF);      /* -1表示不刷新进度 */
            }
        }
    }

    return 0;
}

/*
*********************************************************************************************************
*    函 数 名: h7_ProgBuf
*    功能说明: 开始编程，从新参读入数据。
*    形    参: Flash地址
*			   数据
*    返 回 值: 0 失败   1 成功
*********************************************************************************************************
*/
static int h7_ProgBuf(lua_State* L)
{
    const char *str;
    uint8_t buf[2048];
    size_t len = 0;
    uint32_t FlashAddr;   
    uint8_t mode;    
    
    if (lua_type(L, 1) == LUA_TNUMBER)      /* 判断第1个参数 */
    {
        FlashAddr = luaL_checknumber(L, 1);       
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    } 
    
    if (lua_type(L, 2) == LUA_TSTRING)     /* 判断第2个参数 */
    {        
        str = luaL_checklstring(L, 2, &len); /* 2是参数的位置， len是string的长度 */   
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    }
    
    /* 将字符换转换为2进制数组 
        "FF 00 12 34"   -> 0xFF,0x00,0x12,0x34
    */
    len = AsciiToHex((char *)str, buf, sizeof(buf));

    if (g_tProg.ChipType == CHIP_SWD_ARM)
    {
        if (lua_type(L, 3) == LUA_TNUMBER)      /* 判断第3个参数 */
        {
            mode = luaL_checknumber(L, 3);       
        }
        else
        {
            lua_pushnumber(L, 0);    /* 出错 */
            return 1;
        }
    
        if (PG_SWD_ProgBuf(FlashAddr, buf, len, mode) == 0)
        {    
            lua_pushnumber(L, 1);    /*OK */
        }
        else
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }
    }
    else if (g_tProg.ChipType == CHIP_SWIM_STM8)
    {
        STM8_FLASH_Unlock();
        
        if (STM8_FLASH_ProgramBuf(FlashAddr, buf, len) == 0)
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }
        else
        {
            lua_pushnumber(L, 1);    /* 成功 */
        }       
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
    }
    return 1;    
}

/*
*********************************************************************************************************
*    函 数 名: h7_ProgBuf_OB
*    功能说明: 开始编程，从新参读入数据。 用于option bytes
*    形    参: Flash地址
*			   数据
*    返 回 值: 0 失败   1 成功
*********************************************************************************************************
*/
static int h7_ProgBuf_OB(lua_State* L)
{
    const char *str;
    uint8_t DataBuf[1024];
    uint8_t DataBuf2[1024];
    size_t DataLen = 0;   
    uint8_t AddrBuf[2048];  /* 选项字的地址表，大端模式 */
    size_t AddrLen = 0;

    if (lua_type(L, 1) == LUA_TSTRING)              /* 判断第1个参数 */
    {
        str = luaL_checklstring(L, 1, &AddrLen);    /* 1是参数的位置， len是string的长度 */ 
        AddrLen = AsciiToHex((char *)str, AddrBuf, sizeof(AddrBuf));
        
        if ((AddrLen % 2) != 0)
        {
            lua_pushnumber(L, 0);    /* 出错 */
            return 1;           
        }
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    }
    
    if (lua_type(L, 2) == LUA_TSTRING)          /* 判断第12个参数 */
    {        
        str = luaL_checklstring(L, 2, &DataLen); /* 2是参数的位置， len是string的长度 */ 
        /* 将字符换转换为2进制数组 "FF 00 12 34"   -> 0xFF,0x00,0x12,0x34 */
        DataLen = AsciiToHex((char *)str, DataBuf, sizeof(DataBuf));            
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    }
        
    if (g_tProg.ChipType == CHIP_SWD_ARM)
    {
        uint32_t HeadAddress;
        uint32_t Address;
        uint16_t len = 0;
        uint8_t * pAddr = AddrBuf;
        uint8_t * pData = DataBuf;                    
        
        HeadAddress = BEBufToUint32(AddrBuf);   /* ARM编程OPTION BYTES只需要首地址 */
        while (AddrLen)
        {            
            Address = BEBufToUint32(pAddr); 
            pAddr += 4;               
            AddrLen -= 4;
                            
            if (Address == 0xFFFFFFFF)              /* 遇到0xFFFFFFFF,则插入前第1个数据取反的数据 */
            {
                if (len > 0)
                {
                    DataBuf2[len++] = ~DataBuf2[len - 1];
                }
            }
            else if (Address == 0xFFFFFFFE)          /* 遇到0xFFFFFFFE,则插入前第2个数据取反的数据 */
            {
                if (len >= 2)
                {
                    DataBuf2[len++] = ~DataBuf2[len - 2];
                }
            }            
            else
            {    
                DataBuf2[len++] = *pData++;                 
            }
        }
        
        if (PG_SWD_ProgBuf_OB(HeadAddress, DataBuf2, len) == 0)
        {    
            lua_pushnumber(L, 1);    /* OK */
        }
        else
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }
    }
    else if (g_tProg.ChipType == CHIP_SWIM_STM8)
    {
        if (STM8_ProgramOptionBytes(AddrBuf, AddrLen, DataBuf, DataLen) == 0)
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }
        else
        {
            lua_pushnumber(L, 1);    /* 成功 */
        }       
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
    }    
    return 1;    
}

