armfly/H7-TOOL_STM32H7_App/User/lua/if/lua_if_swd.c
/*
*********************************************************************************************************
*    函 数 名: h7_Read_OptionBytes
*    功能说明: 根据地址列表，读取 option bytes
*    形    参: Flash地址
*			   数据
*    返 回 值: 0 失败   1 成功
*********************************************************************************************************
*/
#define MUL_BUF_STEP    (LUA_READ_LEN_MAX / 4)        /* s_lua_read_buf 平分4组存放结果 */
static int h7_Read_OptionBytes(lua_State* L)
{
    const char *str; 
    uint8_t AddrBuf[2048];  /* 选项字的地址表，大端模式 */
    size_t AddrLen = 0;
    uint8_t err = 0;
    uint16_t len = 0;
    
    if (lua_type(L, 1) == LUA_TSTRING)              /* 判断第1个参数 */
    {
        str = luaL_checklstring(L, 1, &AddrLen);    /* 1是参数的位置， len是string的长度 */ 
        AddrLen = AsciiToHex((char *)str, AddrBuf, sizeof(AddrBuf));
        
        if ((AddrLen % 2) != 0)
        {
            lua_pushnumber(L, 0);    /* 出错 */
            return 1;           
        }
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    }
        
    if (g_tProg.ChipType == CHIP_SWD_ARM)
    {
        uint32_t Address;
        uint32_t LastAddress;
        uint8_t * pAddr = AddrBuf;
        uint32_t TempAddr;
       
        while (AddrLen)
        {            
            Address = BEBufToUint32(pAddr); 
            pAddr += 4;               
            AddrLen -= 4;
                            
            if (Address == 0xFFFFFFFF)              /* 遇到0xFFFFFFFF,则插入一个取反的数据 */
            {
                TempAddr = LastAddress + 1;
            }
            else if (Address == 0xFFFFFFFE)         /* 遇到0xFFFFFFFE,则插入前第2个数据取反的数据 */
            {
                TempAddr = LastAddress + 1;
                LastAddress++;
            }            
            else
            {
                TempAddr = Address;               
                LastAddress = Address;               
            }

            if (g_gMulSwd.MultiMode > 0)   /* 多路模式 */
            {    
                uint8_t buf[4];
                
                if (MUL_swd_read_memory(TempAddr, buf, 1) == 0)
                {
                    err = 1;
                    break;
                }                    
                s_lua_read_buf[0 * MUL_BUF_STEP + len] = buf[0];
                s_lua_read_buf[1 * MUL_BUF_STEP + len] = buf[1];
                s_lua_read_buf[2 * MUL_BUF_STEP + len] = buf[2];
                s_lua_read_buf[3 * MUL_BUF_STEP + len] = buf[3];
            }
            else
            {
                if (swd_read_memory(TempAddr, &s_lua_read_buf[len], 1) == 0)
                {
                    err = 1;
                    break;
                }
            }
            len++;            
        }      
    }
    else if (g_tProg.ChipType == CHIP_SWIM_STM8)
    {
        uint32_t Address;
        uint32_t LastAddress;
        uint8_t * pAddr = AddrBuf;
        
        while (AddrLen)
        {            
            Address = BEBufToUint16(pAddr); 
            pAddr += 2;               
            AddrLen -= 2;
                            
            if (Address == 0xFFFF)          /* 遇到0xFFFFFFFF,则插入一个取反的数据 */
            {
                if (SWIM_ReadBuf(LastAddress + 1, &s_lua_read_buf[len++], 1) == 0)
                {
                    err = 1;
                    break;
                }
            }
            else
            {
                if (SWIM_ReadBuf(Address, &s_lua_read_buf[len++], 1) == 0)
                {
                    err = 1;
                    break;
                }
                LastAddress = Address;               
            }
        }        
    }
    else
    {
        err = 1;
    }
    
    if (err != 0)
    {
        lua_pushnumber(L, 0);    /* 出错 */
    }
    else
    {
        lua_pushnumber(L, 1);    /* 成功 */
    }

    if (g_gMulSwd.MultiMode > 0)   /* 多路模式 */
    {
        lua_pushlstring(L, (char *)(s_lua_read_buf + 0 * MUL_BUF_STEP), len); 
        lua_pushlstring(L, (char *)(s_lua_read_buf + 1 * MUL_BUF_STEP), len); 
        lua_pushlstring(L, (char *)(s_lua_read_buf + 2 * MUL_BUF_STEP), len); 
        lua_pushlstring(L, (char *)(s_lua_read_buf + 3 * MUL_BUF_STEP), len); 
        return 5;         
    }
    else
    {    
        lua_pushlstring(L, (char *)s_lua_read_buf, len);
        return 2;         
    }
   
}

/*
*********************************************************************************************************
*    函 数 名: h7_EraseChip
*    功能说明: 擦除全片，用于OPTION BYTES编程，去除读保护。
*    形    参: Flash地址
*			   数据
*    返 回 值: 0 失败   1 成功
*********************************************************************************************************
*/
static int h7_EraseChip(lua_State* L)
{
    uint32_t FlashAddr;     

    if (lua_type(L, 1) == LUA_TNUMBER)      /* 判断第1个参数 */
    {
        FlashAddr = luaL_checknumber(L, 1);       
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    }

    if (g_tProg.ChipType == CHIP_SWD_ARM)
    {       
        if (PG_SWD_EraseChip(FlashAddr) == 0)
        {    
            lua_pushnumber(L, 1);    /* OK */
        }
        else
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }
    }
    else if (g_tProg.ChipType == CHIP_SWIM_STM8)
    {
        if (STM8_FLASH_EraseChip(FlashAddr) == 0)
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }
        else
        {
            lua_pushnumber(L, 1);    /* 成功 */
        }       
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
    }    
    return 1;    
}

/*
*********************************************************************************************************
*    函 数 名: h7_EraseSector
*    功能说明: 擦除扇区
*    形    参: Flash地址
*			   数据
*    返 回 值: 0 失败   1 成功
*********************************************************************************************************
*/
static int h7_EraseSector(lua_State* L)
{
    uint32_t FlashAddr;     

    if (lua_type(L, 1) == LUA_TNUMBER)      /* 判断第1个参数 */
    {
        FlashAddr = luaL_checknumber(L, 1);       
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    }

    if (g_tProg.ChipType == CHIP_SWD_ARM)
    {       
        if (PG_SWD_EraseSector(FlashAddr) == 0)
        {    
            lua_pushnumber(L, 1);    /* OK */
        }
        else
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }
    }
    else if (g_tProg.ChipType == CHIP_SWIM_STM8)
    {
        if (STM8_FLASH_EraseSector(FlashAddr) == 0)
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }
        else
        {
            lua_pushnumber(L, 1);    /* 成功 */
        }       
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
    }    
    return 1;    
}

