armfly/H7-TOOL_STM32H7_App/User/lua/if/lua_if_swd.c
/*
*********************************************************************************************************
*    函 数 名: h7_Read_ProductSN
*    功能说明: 读产品序号
*    形    参: 无
*    返 回 值: 序号（整数）
*********************************************************************************************************
*/
static int h7_Read_ProductSN(lua_State* L)
{
    lua_pushnumber(L, g_tProgIni.ProductSN);
    return 1;    
}

/*
*********************************************************************************************************
*    函 数 名: h7_Write_ProductSN
*    功能说明: 写产品序号
*    形    参: 无
*    返 回 值: 序号（整数）
*********************************************************************************************************
*/
static int h7_Write_ProductSN(lua_State* L)
{
    uint32_t sn;
    
    if (lua_type(L, 1) == LUA_TNUMBER)      /* 判断第1个参数 */
    {
        sn = luaL_checknumber(L, 1);       
    }
    else
    {
        lua_pushnumber(L, 0);    /* 出错 */
        return 1;
    }
    
    g_tProgIni.ProductSN = sn;    
    lua_pushnumber(L, 1);
    return 1;    
}

/*
*********************************************************************************************************
*    函 数 名: h7swd_ReadExtID
*    功能说明: 读CPU外部芯片的ID
*    形    参: 无
*    返 回 值: 无
*********************************************************************************************************
*/
static int h7swd_ReadExtID(lua_State* L)
{
    uint32_t id = 0;

    if (g_tProg.ChipType == CHIP_SWD_ARM)
    {
        if (swd_init_debug() == 0)
        {
            id = 0;
        }
        
        id = target_flash_init(0x90000000);

        /* SWD进入debug状态 */
        target_flash_enter_debug_program();
        /* 装载算法代码到目标机内存 */
        LoadAlgoToTarget();
        target_flash_init(0x90000000);
        
        id = target_flash_read_extid(0x90000000);
    
        if (id == 0)
        {
            lua_pushnumber(L, 0);    /* 出错 */
        }
        else
        {
            lua_pushnumber(L, id);    /* 成功,返回ID */
        } 
    }
    else if (g_tProg.ChipType == CHIP_SWIM_STM8)
    {
        id = 0x00000000;            /* STM8没有ID, 填一个固定值 */
        lua_pushnumber(L, id);      /* 成功,返回ID */        
    }
    else
    {
        id = 0;
        lua_pushnumber(L, 0);    /* 出错 */
    }
    return 1;
}


/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
